In [ ]:
#PYthon with Mysql connection and create, insert,delete,update,join

In [70]:
from mysql.connector import connect

In [208]:
mydb=connect(
    host="localhost",#local host name
    user= "root",# local lost user name
    password="***" #password 
)
mycursor=mydb.cursor()
mycursor.execute("show databases")
print("======databases========")
for x in mycursor:
    print(x)
  
mycursor.execute("use raja")
mycursor.execute("show tables")
print("========tables==========")
for x in mycursor:
    print(x)

======databases========
('employees',)
('information_schema',)
('mysql',)
('performance_schema',)
('raja',)
('sys',)
========tables==========
('employeedetails',)
('example',)
('institute_std',)
('std_cource_name',)

In [177]:

mycursor.execute("USE raja")  # use database 'raja' with your actual database name

mycursor.execute("SELECT * FROM employeedetails") #table name
myresult=mycursor.fetchall() # We use the fetchall() method, which fetches all rows from the last executed statement.
for x in myresult:
    print(x)

('Alice', Decimal('60000.00'), 'Tech Solutions', 'New York')
('Bob', Decimal('55000.00'), 'Innovatech', 'San Francisco')
('Charlie', Decimal('70000.00'), 'Cyber Dynamics', 'Los Angeles')
('Charlie', Decimal('70000.00'), 'Cyber Dynamics', 'Los Angeles')
('David', Decimal('48000.00'), 'Eco Ventures', 'Austin')
('Eve', Decimal('75000.00'), 'NextGen Inc.', 'Chicago')
('Eve', Decimal('75000.00'), 'NextGen Inc.', 'Chicago')
('Grace', Decimal('68000.00'), 'DataCorp', 'Seattle')
('Hank', Decimal('52000.00'), 'BuildWare', 'Houston')
('Ivy', Decimal('72000.00'), 'Green Energy', 'Boston')
('Ivy', Decimal('72000.00'), 'Green Energy', 'Boston')
('John', Decimal('51000.00'), 'SoftTech', 'Denver')

In [ ]:
# creating 
mycursor.execute("""
    CREATE TABLE Institute_std (
        sno INT AUTO_INCREMENT PRIMARY KEY,
        name VARCHAR(10),
        qualification VARCHAR(10),
        phone VARCHAR(10),
        fee VARCHAR(10)
    )
""")

mydb.commit()# save tha changes in databases

In [99]:
# Define your data as a list of tuples
data = [
    ('Alice', 'Bachelor', '1234567890', '2000'),
    ('Bob', 'Master', '2345678901', '3000'),
    ('Charlie', 'PhD', '3456789012', '4000'),
    ('David', 'Bachelor', '4567890123', '2500'),
    ('Eve', 'Master', '5678901234', '3500'),
    ('Frank', 'PhD', '6789012345', '4500'),
    ('Grace', 'Bachelor', '7890123456', '2700'),
    ('Heidi', 'Master', '8901234567', '3700'),
    ('Ivan', 'PhD', '9012345678', '4700'),
    ('Judy', 'Bachelor', '0123456789', '2900')
]

# Use executemany with the correct syntax
mycursor.executemany(
    "INSERT INTO Institute_std (name, qualification, phone, fee) VALUES (%s, %s, %s, %s)",
    data
)

# Commit the transaction to save the changes
mydb.commit()

In [142]:

mycursor.execute("select * from Institute_std")# selecting all data form Institute_std table
result=mycursor.fetchall()

for x in result:
    print(x)

(1, 'Alice', 'Bachelor', '1234567890', '2000')
(2, 'Bob', 'Master', '2345678901', '3000')
(3, 'Charlie', 'PhD', '3456789012', '4000')
(4, 'David', 'Bachelor', '4567890123', '2500')
(5, 'Eve', 'Master', '5678901234', '3500')
(6, 'Frank', 'PhD', '6789012345', '4500')
(7, 'Grace', 'Bachelor', '7890123456', '2700')
(8, 'Heidi', 'Master', '8901234567', '3700')
(9, 'Ivan', 'PhD', '9012345678', '4700')
(10, 'Judy', 'Bachelor', '0123456789', '2900')
(11, 'Alice', 'Bachelor', '1234567890', '2000')
(12, 'Bob', 'Master', '2345678901', '3000')
(13, 'Charlie', 'PhD', '3456789012', '4000')
(14, 'David', 'Bachelor', '4567890123', '2500')
(15, 'Eve', 'Master', '5678901234', '3500')
(16, 'Frank', 'PhD', '6789012345', '4500')
(17, 'Grace', 'Bachelor', '7890123456', '2700')
(18, 'Heidi', 'Master', '8901234567', '3700')
(19, 'Ivan', 'PhD', '9012345678', '4700')
(20, 'Judy', 'Bachelor', '0123456789', '2900')

In [ ]:
# creating another table
mycursor.execute("create table std_cource_name(id int,cource varchar(10)")

In [204]:
course_data = [
    (10, 'Math'), 
  ]

# Use executemany() for inserting multiple records
mycursor.executemany("INSERT INTO std_cource_name (id, cource) VALUES (%s, %s)", course_data)

# Commit the transaction
mydb.commit()
mycursor.execute("select * from std_cource_name ")

mylist=mycursor.fetchall()

In [212]:
query = """
SELECT 
    Institute_std.sno,
    Institute_std.name,
    Institute_std.qualification,
    Institute_std.phone,
    Institute_std.fee,
    std_cource_name.cource ,
    std_cource_name.id
FROM 
    Institute_std   left JOIN 
    std_cource_name 
ON 
    Institute_std.sno = std_cource_name.id 
    ORDER BY 
    Institute_std.sno desc
    
    ;

"""

mycursor.execute(query)

# Fetch and print the results
for x in mycursor.fetchall():
    print(x)

(20, 'Judy', 'Bachelor', '0123456789', '2900', None, None)
(19, 'Ivan', 'PhD', '9012345678', '4700', None, None)
(18, 'Heidi', 'Master', '8901234567', '3700', None, None)
(17, 'Grace', 'Bachelor', '7890123456', '2700', None, None)
(16, 'Frank', 'PhD', '6789012345', '4500', None, None)
(15, 'Eve', 'Master', '5678901234', '3500', None, None)
(14, 'David', 'Bachelor', '4567890123', '2500', None, None)
(13, 'Charlie', 'PhD', '3456789012', '4000', None, None)
(12, 'Bob', 'Master', '2345678901', '3000', None, None)
(11, 'Alice', 'Bachelor', '1234567890', '2000', None, None)
(10, 'Judy', 'Bachelor', '0123456789', '2900', 'Math', 10)
(10, 'Judy', 'Bachelor', '0123456789', '2900', 'Math', 10)
(9, 'Ivan', 'PhD', '9012345678', '4700', None, None)
(8, 'Heidi', 'Master', '8901234567', '3700', None, None)
(7, 'Grace', 'Bachelor', '7890123456', '2700', None, None)
(6, 'Frank', 'PhD', '6789012345', '4500', None, None)
(5, 'Eve', 'Master', '5678901234', '3500', None, None)
(4, 'David', 'Bachelor', '4567890123', '2500', None, None)
(3, 'Charlie', 'PhD', '3456789012', '4000', None, None)
(2, 'Bob', 'Master', '2345678901', '3000', 'Science', 2)
(2, 'Bob', 'Master', '2345678901', '3000', 'Science', 2)
(1, 'Alice', 'Bachelor', '1234567890', '2000', None, None)

In [214]:
#with where clause
query = """
SELECT 
    Institute_std.sno,
    Institute_std.name,
    Institute_std.qualification,
    Institute_std.phone,
    Institute_std.fee,
    std_cource_name.cource ,
    std_cource_name.id
FROM 
    Institute_std   left JOIN 
    std_cource_name 
ON 
    Institute_std.sno = std_cource_name.id where  Institute_std.sno>4
    ORDER BY 
    Institute_std.sno desc
    
    ;

"""

mycursor.execute(query)

# Fetch and print the results
for x in mycursor.fetchall():
    print(x)

(20, 'Judy', 'Bachelor', '0123456789', '2900', None, None)
(19, 'Ivan', 'PhD', '9012345678', '4700', None, None)
(18, 'Heidi', 'Master', '8901234567', '3700', None, None)
(17, 'Grace', 'Bachelor', '7890123456', '2700', None, None)
(16, 'Frank', 'PhD', '6789012345', '4500', None, None)
(15, 'Eve', 'Master', '5678901234', '3500', None, None)
(14, 'David', 'Bachelor', '4567890123', '2500', None, None)
(13, 'Charlie', 'PhD', '3456789012', '4000', None, None)
(12, 'Bob', 'Master', '2345678901', '3000', None, None)
(11, 'Alice', 'Bachelor', '1234567890', '2000', None, None)
(10, 'Judy', 'Bachelor', '0123456789', '2900', 'Math', 10)
(10, 'Judy', 'Bachelor', '0123456789', '2900', 'Math', 10)
(9, 'Ivan', 'PhD', '9012345678', '4700', None, None)
(8, 'Heidi', 'Master', '8901234567', '3700', None, None)
(7, 'Grace', 'Bachelor', '7890123456', '2700', None, None)
(6, 'Frank', 'PhD', '6789012345', '4500', None, None)
(5, 'Eve', 'Master', '5678901234', '3500', None, None)

In [218]:
#delete data with where clause from the table
query="delete from  Institute_std where qualification='PhD' "
mycursor.execute(query)

In [223]:

mycursor.execute("select * from Institute_std ")
for x in mycursor.fetchall():
    print(x)

(1, 'Alice', 'Bachelor', '1234567890', '2000')
(2, 'Bob', 'Master', '2345678901', '3000')
(4, 'David', 'Bachelor', '4567890123', '2500')
(5, 'Eve', 'Master', '5678901234', '3500')
(7, 'Grace', 'Bachelor', '7890123456', '2700')
(8, 'Heidi', 'Master', '8901234567', '3700')
(10, 'Judy', 'Bachelor', '0123456789', '2900')
(11, 'Alice', 'Bachelor', '1234567890', '2000')
(12, 'Bob', 'Master', '2345678901', '3000')
(14, 'David', 'Bachelor', '4567890123', '2500')
(15, 'Eve', 'Master', '5678901234', '3500')
(17, 'Grace', 'Bachelor', '7890123456', '2700')
(18, 'Heidi', 'Master', '8901234567', '3700')
(20, 'Judy', 'Bachelor', '0123456789', '2900')

In [224]:
#updating the table
quary="update Institute_std  set fee=5000 where sno=2"
mycursor.execute(quary)

In [225]:

mycursor.execute("select * from Institute_std ")
for x in mycursor.fetchall():
    print(x)

(1, 'Alice', 'Bachelor', '1234567890', '2000')
(2, 'Bob', 'Master', '2345678901', '5000')
(4, 'David', 'Bachelor', '4567890123', '2500')
(5, 'Eve', 'Master', '5678901234', '3500')
(7, 'Grace', 'Bachelor', '7890123456', '2700')
(8, 'Heidi', 'Master', '8901234567', '3700')
(10, 'Judy', 'Bachelor', '0123456789', '2900')
(11, 'Alice', 'Bachelor', '1234567890', '2000')
(12, 'Bob', 'Master', '2345678901', '3000')
(14, 'David', 'Bachelor', '4567890123', '2500')
(15, 'Eve', 'Master', '5678901234', '3500')
(17, 'Grace', 'Bachelor', '7890123456', '2700')
(18, 'Heidi', 'Master', '8901234567', '3700')
(20, 'Judy', 'Bachelor', '0123456789', '2900')